#!/bin/sh
#############################################################################
#
#  機能概要     : エラー画面への切替 シェル
#
#  引数         : 無
#
#  戻り値       : ==0 正常終了
#               : !=0 異常終了
#
##############################################################################
#------------------#
# 環境変数読み込み #
#------------------#
. /home/batchuser/job/profile/.profile
#-----------#
# JOBの実行 #
#-----------#
echo "-----------------------------------------------------------------"
echo "---- CUCM連携アプリケーション・エラー画面切り替えスクリプト  ----"
echo "-----------------------------------------------------------------"
cp -fp ${KSH_DIR}/maintenance/error.jsp ${WEBDIR}/WEB-INF/jsp/login.jsp
echo "*** 画面がエラー画面に切り替わったことを確認してください。"

exit $?